import math # Подключаем библиотеку math для вычисления квадратного корня
radius = float(input("Пожалуйста введите радиус круга в (см): ")) # Прошу пользователя ввести значение радиуса
# Вычислляю с помощью формулы 2пR длину окружности , пR**2 - площадь круга
print(f"{2*math.pi*radius} см. {(2*math.pi*radius)/100} м.- длина окружности, {math.pi*(radius**2)} см2. {(math.pi*(radius**2))/10000} м2. - площадь круга")
# Вычисляю с помощью формулы R*2**1/2 - сторону вписанного в окружность квадрата, r*3**1/2 - сторону равностороннего треугольника
print(f"{radius*math.sqrt(2)} см., {(radius*math.sqrt(2))/100} м. - сторона вписанного в окружность квадрата, {radius*math.sqrt(3)} см. , {(radius*math.sqrt(3))/100} м. - сторона равностороннего треугольника")
# a = 2r - вычисляю сторону квадрата, a = 2\sqrt{3}r - вычисляю сторону равностороннего треугольника, a = 2(\sqrt{2}-1)r\) - вычисляю сторону восьмиугольника.
print(f"{2*radius} см. , {(2*radius)/100} м. - сторона квадрата. {2*math.sqrt(3)*radius} см., {(radius*2*math.sqrt(3))/100}  м. - cторона равностороннего треугольника. {2*(math.sqrt(2)-1)*radius} см., {(2*(math.sqrt(2)-1)*radius)/100} м. - сторона восьмиугольника")   